micropython/micropython/ports/raspberrypi/boards/vcc_gnd_yd_rp2040/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2022 Fabian Affolter <fabian@affolter-engineering.ch>
//
// SPDX-License-Identifier: MIT

#define MICROPY_HW_BOARD_NAME "VCC-GND Studio YD RP2040"
#define MICROPY_HW_MCU_NAME "rp2040"

#define MICROPY_HW_NEOPIXEL (&pin_GPIO23)
